import re
import sys
pl=['@','#','$']
v = [list("|*****|") for i in range(4)]


pm = '''\nПравила игры - игроки поочередно вводят координаты клеток поля заполняя его своими символами.\n
Игроки должны стараться чтобы их символы не были расположены рядом в соседних клетках
(имели общую сторону или были расположены наискосок друг от друга).\nЗа каждое соседство добавляется штрафной бал.\n
Игрок(и) с наименьшим количеством балов побеждает(ют). Справа от игрового поля выводится количество штрафных баллов для каждого игрока а также чей сейчас ход.
\nТеперь введите пожалуйста следующие координаты.'''

# Проверка на наличее соседствующих одинаковых символов
def pr():
    global v,pl,k,bl
    for i in range(-2,1):
        if a + i > -1 and a + i < 4:
            for j in range(-1, 2):
                if v[a+i][b+j] == pl[k]:
                    bl[k]+=1
    v[a-1][b]=pl[k]
    
# Функция вывода интерфейса
def vvd(): 
    global v,pl,k,bl 
    print(end="    ")
    for i in range(5):
        print(i+1,end=" ")
    print()
    for i in range(4):
        print(i+1,end=" ")
        for j in range(7):
            print(v[i][j],end=' '); 
        if i < 3:
            print("Игрок ",str(pl[i]), " :",str(bl[i]),sep='')
        else:
            print("Ход игрока: ",pl[k])
            
# Функция ввожа координат
def inp(): 
    global a,b # Инициализация а и b как глобальные переменные
    print("Введите координаты разделенные: пробелом '.' ',' или '-'")
    s = input("Строка, столбец:")
    if "end" in s:
        return True
    if "?" in s:
        print(pm); inp()
    elif re.search(r'[^0-9\s.,-]', s): # Есть ли символы кроме цифр разделяющтих знаков
        print("!! Неверно введены координаты"); inp()
    else:
        s = re.split(r'\D+', s) # Разбиение строки на числа
        if len(s)==2:
            try:
                [a,b]=[int(s[0]),int(s[1])]
            except:
                print("!! Введены неправильные координаты"); inp()
            if a > 4 or a < 1 or b > 5 or b < 1:
                print("!! Выход за границы поля"); inp()
            elif v[a-1][b] != "*":
                print("!! Поле уже занято"); inp()
            else:
                pr() # Выявление штрафных баллов 
        else:
            print("!! Координаты должны состоять из двух чисел разделённые пробелом"); inp()
            
# Основной цикл программы            
k = 0
bl=[0,0,0]
while "*" in v[0] or "*" in v[1] or "*" in v[2] or "*" in v[3]: 
    k = k%3; vvd()
    print("\nВ случае возникновения вопроса введите '?'")
    if inp()==True:
        break
    k+=1
vvd()
# Вывод победителя(лей)   
a = list()
for i in range(3): 
    if bl[i]==min(bl):
        a.append(i)
if len(a)>2:
    print("Ничья")
elif len(a)>1:
    print("Победители:",end=" ")
    for i in a:
        print(pl[i],end=" ")
else:
    print(f"Победитель {pl[a[0]]}")
